<!--
function init()
{ 
  var level0Array=level0.split("0;");  
  for(var i=0;i<level0Array.length-1;i++)
 {  
    var temp=level0Array[i].split(",");
    var oOption = document.createElement("OPTION");
    document.all.pID0.options.add(oOption);
	oOption.innerText = temp[1];
    oOption.value = temp[0];
  }
}
function checkChar(){
	var str=document.all.blog.blogName.value;
	var SPECIAL_STR = "~!@%^&*();'\"?><[]{}\\|,:/=+—“”‘";
	for(i=0;i<str.length;i++)
	if (SPECIAL_STR.indexOf(str.charAt(i)) !=-1){
	alert("博客名称不能以含有非法字符("+str.charAt(i)+")！");
	document.all.blog.blogName.focus();
	return false;}
	if(str.length == 0){
		document.all.blog.blogName.focus();
		return false;
	}
	return true;
}	
var level0="193,海外原创,0;10,影视音乐,0;21,女人世界,0;2,健康养生,0;7,汽车天地,0;203,新闻时事,0;11,体育运动,0;13,ＩＴ业界,0;20,游戏天下,0;18,个人收藏,0;5,文学作品,0;6,时尚生活,0;17,亲亲宝贝,0;14,家居理财,0;199,风水占扑,0;9,财经金融,0;22,经营管理,0;4,教育培训,0;202,笑话幽默,0;3,旅人游记,0;16,文化艺术,0;1,爱是有缘,0;15,校园生活,0;23,隐私日记,0;200,信仰家园,0;204,网上谈兵,0;12,科学探索,0;198,历史怀旧,0;201,人在他乡,0;19,图片欣赏,0;"; 
var level1="24,初恋时节,1;25,围城故事,1;26,网络情缘,1;27,单身生活,1;28,中年人生,1;29,都市夜生活,1;30,海外游子,1;31,同志情深,1;32,失恋阵线,1;33,凡人小记,1;34,友情故事,1;35,亲情,1;36,生活,1;37,心理茶室,2;38,医护之家,2;39,两性健康,2;40,中医养生,2;41,食疗营养,2;42,自然风光,3;43,边走边记,3;44,民俗风情,3;45,美景佳作,3;46,食遍天下,3;47,结伴出行,3;48,英语沙龙,4;49,考研辛路,4;50,考试资讯,4;51,培训心得,4;52,留学海外,4;53,高考招生,4;54,移民异国,4;55,小说连载,5;56,散文随笔,5;57,长篇连载,5;58,杂谈酷评,5;59,文学批评,5;60,武侠圣殿,5;61,网络原创,5;62,短篇小说,5;63,另类文学,5;64,笑话天地,7;65,星座血型,6;66,逛街购物,6;67,美食厨房,6;68,泡吧一族,6;69,宠物宝贝,6;70,美体塑身,6;71,靓发美容,6;72,学车交流,7;73,汽车热评,7;74,名车荟萃,7;75,装饰改装,7;76,修车保养,7;77,试车报告,7;78,人物观察,203;79,采访日记,203;80,学术研究,203;81,传媒视点,203;82,混在圈内,203;83,秘密档案,203;84,财经茶坊,9;85,股市风云,9;86,汇市沙龙,9;87,期货市场,9;88,电子商务,9;89,营销研究,9;90,金融投资,9;91,企业管理,9;92,电影世界,10;93,原创音乐,10;94,我的偶像,10;95,电视剧场,10;96,动漫情怀,10;97,原创剧本,10;98,戏剧舞台,10;99,幕后是非,10;100,足球杂谈,11;101,户外运动,11;102,赛车,11;103,彩民生活,11;104,棋牌,11;105,篮球,11;106,体坛明星,11;107,极限运动,11;108,考古论坛,12;109,动物世界,12;110,科学谜团,12;111,太空探索,12;112,网络安全,13;113,电脑游戏,13;114,软件工具,13;115,硬件DIY,13;116,图形设计,13;117,闪客地带,13;118,程序人生,13;119,ＢＴ下载,13;120,认证考试,13;121,通信业界,13;122,数码,13;123,笔记本,13;124,家电,13;125,手机,13;126,IT业界,13;127,IT评论,13;128,IT综合,13;129,互联网,13;130,我爱我家,14;131,家居装饰,14;132,购房心得,14;133,我家理财,14;134,谈房论市,14;135,校园爱情,15;136,幽默笑话,15;137,绝对原创,15;138,两性地带,15;139,校园生活,15;140,情感话题,15;141,我的同学,15;142,校园日记,15;143,新闻评论,15;144,时事评论,15;145,个人观点,15;146,焦点评论,15;147,围炉夜话,15;148,视觉艺术,16;149,艺术家,16;150,摄影,16;151,艺术史,16;152,民间艺术,16;153,文学艺术,16;154,家庭育儿,17;155,成长日记,17;156,我爱宝宝,17;157,音乐,18;158,影视,18;159,我的兄弟姐妹,18;160,爱人朋友,18;161,我的收藏夹,18;162,好吃的,18;163,好玩的,18;164,现在的心情,18;165,养眼美女,19;166,风景图片,19;167,名车图片,19;168,个人作品,19;169,名家作品,19;170,攻略秘笈,20;171,游戏文学,20;172,怀旧经典,20;173,资源共享,20;174,心情札记,21;175,美容化妆,21;176,白领丽人,21;177,居家琐事,21;178,妈妈日记,21;179,青春花季,21;180,创业之路,22;181,管理案例,22;182,市场营销,22;183,前沿关注,22;184,焦点人物,22;185,项目管理,22;186,财经杂谈,22;187,理论研究,22;188,凡人小记,23;189,旧爱新欢,23;190,猎人笔记,23;191,非常感觉,23;192,绝对隐私,23;194,个人文集,193;195,即兴随笔,193;196,纪实文学,193;197,现代故事,193;205,历史人物,198;206,历史事件,198;207,秘密档案,198;208,历史传说,198;209,历史评断,198;210,星相探索,199;211,紫薇斗数,199;212,八卦命理,199;213,基督之家,200;214,宗教世界,200;215,佛缘在心,200;216,回教探索,201;217,人在美国,201;218,人在加拿大,201;219,人在日本,201;220,人在德国,201;221,人在法国,201;222,人在英国,201;223,人在新加坡,201;224,人在韩国,201;225,人在澳洲,201;226,人在欧洲,201;227,人在新西兰,201;228,人在非洲,201;229,成人笑话,202;230,英文笑话,202;231,漫画幽默,202;232,国际观察,203;233,我的中国,203;234,两岸交流,203;235,时事快评,203;236,网上谈兵,204;238,兵法研究,204;239,军事天地,204;240,兵器大观,204;241,现代战术,204;242,经典战役,204;243,开国将帅,204;"; 

function clear(o)
{
   for (var i=o.length-1;i>0;i--)
   {
     o.options.remove(i);
   }
   o.selectedIndex[0];
}


function changeLevel0()
{  clear(document.all.pID1);
   var level1Array=level1.split(";");   
   for(var i=0;i<level1Array.length-1;i++)
   {
      var temp=level1Array[i].split(",");	  
	  if(temp[2]==document.all.pID0.value)
	  { var oOption = document.createElement("OPTION");
		document.all.pID1.options.add(oOption);
		oOption.innerText = temp[1];
		oOption.value = temp[0];
	  }
   }
}
//-->